// 2) ახსენით რა არის პრიმიტიული და კომპლექსური მონაცემთა ტიპები, stack & heap მეხსიერება, მოიყვანეთ მაგალითები და გააკეთეთ ნახაზი

// primitive - პრიმიტიული ტიპები არის მარტივი მნიშვნელობები, რომლებიც ინახავენ მხოლოდ ერთ კონკრეტულ მნიშვნელობას.
let a = 30;
let b = a;

b = 20;

console.log(a);
console.log(b);

// complex -კომპლექსური ტიპები არის ობიექტები, რომლებიც ინახავენ ბევრ მნიშვნელობას ერთდროულად.

let obj1 = { name: "Gio" };
let obj2 = obj1;

obj2.name = "luka";

console.log(obj1.name); 

// Stack არის მეხსიერება, სადაც ინახება: პრიმიტიული ტიპები, ფუნქციის გამოძახებები და სხვა.

// Heap არის მეხსიერება, სადაც ინახება:ობიექტები,მასივები, ფუნქციები