// 2) ახსენით რა განსხვავებაა სინქრონულ და ასინქორნულ კოდს შორის, მოყივანეთ მაგალითები რეალური ცხოვერბიდან და პროგრამიდან

//სინქრონული (Synchronous) კოდი - სინქრონული კოდი მუშაობს რიგით — ერთი ოპერაცია უნდა დასრულდეს, სანამ შემდეგი დაიწყება.

//ასინქრონული (Asynchronous) კოდი - ასინქრონული კოდი არ აჩერებს პროგრამას ლოდინის დროს.თუ რაიმე ოპერაციას დრო სჭირდება (მაგ: სერვერიდან მონაცემის მიღება), პროგრამა სხვა საქმეებს აგრძელებს.

console.log("first");

setTimeout(() => {
    console.log("second");
}, 2000);

console.log("third");

// მთავარი განსხვავება:
// სინქრონული- ელოდება ოპერაციის ბლოკავს კოდს
// ასინქრონული - დასრულებას არ ელოდება, არ ბლოკავს კოდს