#2) შექმენით 5 ცვლადი რომლებშიც შეინახავთ წიგნების თავდაპირველ ფასს, შემდეგ შექმენით ცვლადი რომელშიც შეინახავთ ფასდაკლების ოდენობას, შექმენით ახალი ფასის მქონე წიგნების ცვლადები, რომელთა მნიშვნელობა იქნება ძველ მნიშვნელობას გამოკლებული ახალი, საბოლოოდ კი დაბეჭდეთ ახალი წიგნების ფასები (გამოიყენეთ კარგი მიდგომები: რომ ცვლადის მნიშვნელობის მინიჭებისას შეგიძლიათ სხვა ცვლადის გამოყენება, კოდი ახსენით კომენტარების საშვალებით, ცვლადებს დაარქვით აღმწერი სახელები snake_case-ის სტილში)

# ვქმნით ცვლადებს სადაც გვაქვს წიგნების თავდაპირველი ფასი
book_1 = 12
book_2 = 24
book_3 = 19
book_4 = 35
book_5 = 102

# ვქმნით ცვლადს სადაც გვაქვს ფასდაკლება
sale = 10

# ვქმნით ახალ ცვლადებს სადაც თავდაპირველ ფასს ვაკლებთ ფასდაკლებას
book_1_sale = book_1 - sale
book_2_sale = book_2 - sale
book_3_sale = book_3 - sale
book_4_sale = book_4 - sale
book_5_sale = book_5 - sale

# საბოლოოდ გამოგვაქვს ფადაკლებული წიგნების ფაფი
print(book_1_sale)
print(book_2_sale)
print(book_3_sale)
print(book_4_sale)
print(book_5_sale)