# 3) დაწერეთ სტატია Node.js-ის core modules-ის შესახებ: console, process, os, util. გაიხსენეთ თითოეული ფუნქციები, როგორ შეგიძლიათ მათთან მუშაობა და მაგალითები მათი გამოყენების


# Node.js შეიცავს ჩაშენებულ (Core) მოდულებს, რომლებიც დამატებითი ინსტალაციის გარეშე შეგვიძლია გამოვიყენოთ. ისინი გვაძლევენ სხვადასხვა სისტემურ და დამხმარე ფუნქციებს. ამ სტატიაში განვიხილავთ ოთხ მნიშვნელოვან Core Module-ს:

# console
# process
# os
# util

# Console Module

# console გამოიყენება ინფორმაციის ტერმინალში გამოსატანად, შეცდომების საჩვენებლად და პროგრამის გამართვისთვის

# Console Module

# console გამოიყენება ინფორმაციის ტერმინალში გამოსატანად, შეცდომების საჩვენებლად და პროგრამის გამართვისთვის

# OS Module

# os მოდული გვაწვდის ინფორმაციას ოპერაციული სისტემის შესახებ.

# იმპორტი: const os = require('os');

# Util Module

# util არის დამხმარე მოდული, რომელიც შეიცავს სხვადასხვა სასარგებლო ფუნქციას.

# იმპორტი: const util = require('util');