// 8) შექმენით თარიღის ობიექტი, რომელშიც შეინახავთ 2024 წლის დეკემბრის 25 რიცხვს. ობიექტის შექმნისას გამოიყენეთ new Date(year, month, day) ფორმატი. კომენტარებით ახსენით რით განსხვავდება ეს ფორმა string-ის გადაცემისგან, შექმნილი ობიექტიდან ცალცალკე გამოიტანეთ წელი, თვე, და დღე კონსოლში, ასევე აჩვენეთ რა შედეგს დააბრუნებს getDay() ფუნქცია ამ თარიღისთვის

const date = new Date(2024-12-25)

console.log(date.getFullYear())
console.log(date.getMonth())
console.log(date.getDate())

console.log(date.getDay())