// 4) ახსენით რა არის HTTP Status Codes, რას ნიშნავს:
// - 200 (OK)  
// - 201 (Created)  
// - 400 (Bad Request)  
// - 404 (Not Found)  
// - 500 (Internal Server Error)  
// და როდის ვიყენებთ თითოეულს


// HTTP Status Codes არის სამნიშნა კოდები, რომლებსაც სერვერი აგზავნის კლიენტთან (ბრაუზერი, Postman და ა.შ.) მოთხოვნის დამუშავების შედეგის აღსაწერად.

// ისინი გვიჩვენებენ:

// შესრულდა თუ არა მოთხოვნა წარმატებით;
// მოხდა თუ არა შეცდომა;

// 200 (OK)

// ნიშნავს, რომ მოთხოვნა წარმატებით დამუშავდა.

// 201 (Created)

// ნიშნავს, რომ სერვერმა წარმატებით შექმნა ახალი რესურსი.

// 400 (Bad Request)

// ნიშნავს, რომ კლიენტის მიერ გაგზავნილი მოთხოვნა არასწორია.

// 404 (Not Found)

// ნიშნავს, რომ მოთხოვნილი გვერდი ან რესურსი ვერ მოიძებნა.

// 500 (Internal Server Error)

// ნიშნავს, რომ სერვერზე შიდა შეცდომა მოხდა.