'''1) შექმენით ცვლადი რომელშიც შეინახავთ მომხმარებლის ანგარიშის ემაილს, კომენმტარებით ახსენით თუ რატომ არ ვწერთ ამ ცვლადის სახელის სიტყვებს შეერთებულად და რა ქვია იმ მიდგომას რომელსაც თქვენ იყენებთ, ასევე დაწერეთ თქვენი სიტყვებით თუ რა არის ცვლადი და ჩამოწერეთ მისი შექმნის ნაბიჯები (3), საობლოოდ შექმენით ცვლადი number შემდეგ შეცვალეთ მისი მნიშვნელობა Number = 10-ით, საბოლოოდ კი NuMBEr = 20-ით და დაბეჭდეთ ეს მნიშვნელობა აღწერეთ რა შედეგი მიიღეთ და რატომ რას ნიშნავს python არის case senseitive'''

user_mail = "usermail99@gmail.com"
#ცვლადში სახელის წერის დროს spaice ს გამოყენება არ შეიძლება ჩვენ ვიყენებთ ქვედა ტირეს  (_) და ამას snake case ჰქვია

# ცვლადი იქმნება პირველ რიგში ცვლადის სახელი შემდეგ ტოლობის ნიშანი და მერე ცვლადის მნიშვნელობა. ცვლადი არის 


#ცვლადის შექმნის  შემთხვევაში თუ ერთი ასოც თუ სხვანარად დავწერთ სხვა შედეგს გამოიტანს
#number = 5
#Number = 10
#NuMBEr = 20

# ეს დაბეჭდავს 5 ს რადგან ყველა ასოს მნისვნელობა აქ და number  ამ შემთხვევაში 5ს ნიშნავს

#პიტონი არის სენსიტიური და ყველა ასოს აითქვამს და ერთი დიდი ასოს დაწერის შემთხვევაშიც სხვა შედეგს მივიებთ




#შექმენით პროგრამა რომელშიც გექნებათ თქვენი საყვარელი ბოსტნეულის ცვლადი, შემდეგ განაახლეთ ამ ცვლადის მნიშვნლობა ჯერ უბრალო გზით შემდეგ კი მინჭბის ოპერატორით (გამოიყენეთ ორივე ოპერაცია +, *), ასევე გააკეთეთ int ტიპის ცვლადი რომლის მნიშვნელობასაც განაახლებთ უბრალო ფორმით და შემდეგ assignment ოპერატორით. ასევე კომენტარებით დაწერეთ ცვლადის სახელის წესებით, თქვენ მიერ შექმნილი ცვლადები fstring-ის მეშვეობით დაბეჭდეთ, პირველი ცვლადის fstring ჯერ ახალ message ცვლადში შეინახეთ უნდა გამოიტანოთ my favourite vegetable is <vegetable>, შემდეგ კი მეორე ცვლადისთვის პირდაპირ დაბეჭდეთ fstring-ით fstring ახსენთ კომენტარებით

#ცვალდი არ შეიძლება დაიწყოს რიცვხვით არც space ბი შეიძლებაარც რაიმე მოქმედება (გამოკლება გაყოდა და ა. შ)
vegetable = "potato"
vegetable *= 3
print(vegetable)

vegetable= "potato"
vegetable += 9
print(vegetable)

number = 90
number += 200
print(number)

number = 80
number *= 8
print(number)


print(f"my favourite vegetable is {vegetable}" )