# 5) for ციკლის საშვალებით გამოიტანეთ რიცხვები 30-ის ჩათვლით

for num in range(0,31):
    print(num)

# 6) for ციკლის საშვალებით გამოიტანეთ რიცხვები 15-იდან 80-მდე

for num in range(15,80):
    print(num)

# 7) for ციკლის საშვალებით გამოიტანეთ რიცხვები 0-იდან 88-ის ჩათვლით

for num in range(0,89):
    print(num)

# 8) for ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ჩათვლით

for num in range(0,51,3):
    print(num)

# 9) მომხმარებელს შემოატანინეთ 2 რიცხვი, შემდეგ კი პირველი რიცხვიდან მეორეს ჩათვლით არსებული ყველა რიცხვი დაბეჭდეთ

a = 60
b = 80

for i in range(a,b + 1):
    print(i)

# 10) პროგრამას გამოტანინეთ ყველა ლუწი რიცხვი 100-მდე

for num in range(0,101,2):
    print(num)

# 11) for ციკლის საშვალებით გამოთვალეთ რიცხვების ჯამი 20-იდან 40-მდე

sum_numbers = 0
for num in range(20,41):
    sum_numbers += num

print(sum_numbers)

# 12) for ციკლის საშვალებით გამოთვალეთ 10-იდან 50-ის ჩათვლით ყველა რიცხვის ჯამი

sum_numbers = 0
for num in range(20,41):
    sum_numbers += num

print(sum_numbers)

# 13) for ციკლის საშვალებით გამოთვალეთ 20-იდან 100-მდე ყველა ლუწი რიცხვის ჯამი, საბოლოოდ დაბეჭდეთ შედეგი

sum_numbers = 0
for num in range (20,100 ,2):
    sum_numbers += num

print(sum_numbers)

# 14) for ციკლის საშვალებით გამოთვალეთ 7-ის ფაქტორიალი. რიცხვის ფაქტორიალი არის ყველა რიცხვის ნამრავლი ამ რიცხვიდან 1-მდე

factorial = 1
for num in range(1,8):
    factorial *= num

print(factorial)

# 15) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 0-იდან 20-მდე

i = 0
while i <=20:
    print(i)
    i+=1

# 16) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 10-იდან 30-ის ჩათვლით

i = 10
while i <= 31:
    print(i)
    i += 1

# 17) while ციკლის საშვალებით დაბეჭდეთ რიცხვები 15-იდან 80-მდე

i = 15
while i <= 80:
    print(i)
    i += 1

# 18) while ციკლის საშვალებით გამოიტანეთ რიცხვები 50-იდან 0-ჩათვლით

i = 50
while i >= 0:
    print(i)
    i -= 1

# 19) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 0-იდან 50-ის ჩათვლით

i = 0
while i<=50:
    print(i)
    i += 3

# 20) while ციკლის საშვალებით გამოიტანეთ ლუწი რიცხვები 0-იდან 50-ის ჩათვლით

i = 0
while i<=50:
    print(i)
    i += 2

# 21) while ციკლის საშვალებით გამოიტანეთ ყოველი მესამე რიცხვი 100-იდან 20-ის ჩათვლით

i = 100
while i >= 20:
    print(i)
    i -= 3

# 22) შექმენით პროგრამა რომელიც მომხმარებელს შეეკითხება პაროლს სანამ ის არ შემოიყვანს goabest123-ს

pin_code="goabest123"

code = input("Enter yout pin code: ")

while code != pin_code :
    code = input("Enter your code: ")

print("code is correct !")

# 23) შექმენით პროგრამა while ციკლით რომელიც მომხარებელს შეეკითხება pin კოდს (4 ციფრიანი კოდი) იქამდე სანამ არ შემოიყვანს სწორად, საბოლოოდ დაუბეჭდეთ რომ გაიარა ავტორიზაცია და გამოუტანეთ თუ რამდენი ცდა დასჭირდა

pin_code="8274"

code = input("Enter yout pin code: ")

while code != pin_code :
    code = input("Enter your code: ")

print("code is correct !")

# 24) პროგრამას გამოატანინეთ რიცხვები 20-იდან 0-მდე, for ციკლით

for num in range(20,-1,-1):
    print(num)