# 14) დაწერეთ რა არის ფუნქცია, რისთვის ვიყენებთ, რამდენი ტიპის არსებობს, რა არის პარამეტრები, არგუმენტები და დაბრუნება (return)

# ფუნქცია არის კოდის გარკვეული ბლოკი, რომელსაც აქვს სახელი და ასრულებს კონკრეტულ ამოცანას.
# ფუნქციებს ვიყენებთ იმისთვის, რომ:გავზარდოთ კოდის წაკითხვადობა და გასაგებლობა .დავამარტივოთ შეცდომების პოვნა და გასწორება
# პარამეტრები (parameters) — ეს არის ცვლადები, რომლებიც ფუნქციის განსაზღვრისას ვწერთ, რათა ფუნქციამ მიიღოს მონაცემები.
def greet(name):   # აქ name არის პარამეტრი
    print("Hello", name)
# არგუმენტები (arguments) — ეს არის რეალური მნიშვნელობები, რომლებსაც ფუნქციის გამოძახებისას ვაწვდით.
greet("Nika")   # აქ "Nika" არის არგუმენტი

# return — ფუნქციიდან მნიშვნელობის უკან დაბრუნებაა.ფუნქცია, რომელსაც აქვს return, შეიძლება გამოიყენოთ როგორც მონაცემის მომწოდებელი.
def add(a, b):
    return a + b

result = add(3, 5)
print(result)  # 8