# 12) მომხმარებელს შემოაყვანინეთ წინადადება, შემდეგ for ციკლისა და პირობითი განცხადებების საშვალებით დაბეჭდეთ ჯერ ხმოვნების, შემდეგ კი თანხმოვნების რაოდენობა (ხმოვნებად ჩათვალეთ სიმბოლოები: a, e, i, o, u ხოლო სხვა ყველა თანხმოვნად)

sentence = input("შეიყვანე წინადადება: ")

vowels = 0        
consonants = 0   

for ch in sentence:
    if ch:              
        if ch in "aeiou":        
            vowels += 1
        else:                     
            consonants += 1

print("ხმოვნების რაოდენობა:", vowels)
print("თანხმოვნების რაოდენობა:", consonants)