// 1)შექმენით ფუნქცია sum რომელსაც გადაეცემა ორი არუმნეტი x,y და უნდა დააბრუნოს მათი ჯამო
// შექმენით ფუნქცია isEven რომელიც დააბრუნებს ბულიანს , თუ რიცხვი არის ლუწი true , თუ არ არის false

function sum(x, y) {
    return x + y;
}

function isEven(num) {
    return num % 2 === 0;
}

sum(5, 3)


// 2)შექმენით ფუნქცია checkRole რომელიც  იქნება arrow ფუნქცია გადაეცემაა string რომელიც შეილება იყოს "admin", "user", "moderator", თუ არის ადმინი გამოიტანოს მესიჯი ყველაფერზე გაქ წვდომა, თუ არის მოდერატორი გამოიტანოს მესიჯი "შენმი წვდომა ლიმიტირებულია " და თუ არის უზერი გამოიტანოს მესიჯი "არაფერზე არ გაქ წვდომა
// ყველაფერი ერთ ხაზში

const checkRole = role => { 
    if (role === "admin") return "ყველაფერზე გაქ წვდომა"
    else if (role === "moderator") return "შენი წვდომა ლიმიტირებულია"; 
    else if (role === "user") return "არაფერზე არ გაქ წვდომა"; 
    else return "უცნობი როლი"; };