# 4) ახსენით რას ნიშნავს რომ list და string არის დალაგებული მიმდევრობები, კომენტარებით დაწერეთ მათ თვისებებს შორის განსხვავებები. მოიყვანეთ მაგალითები

# List-ებიც და String-ებიც არიან დალაგებული მიმდევრობები, რაც ნიშნავს რომ:
# თითოეულ ელემენტს აქვს კონკრეტული პოზიცია (ინდექსი)
# ელემენტების მიმდევრობა ინახება და არ იცვლება თვითონ
# შეგვიძლია მივწვდეთ ელემენტებს ინდექსის მიხედვით (მაგ. my_list[0], my_string[2])


# განსხვავებები
# ორივე არის დალაგებული მიმდევრობა
my_list = [10, 20, 30]
my_string = "ABC"

# ელემენტებზე წვდომა ინდექსით
print(my_list[1])     # 20
print(my_string[1])   # "B"

# List არის მუტაბელური (შეცვლადი)
my_list[0] = 99       #list-ში ელემენტების შეცვლა შეიძლება

# String არის იმუტაბელური (არშეცვლადი)
# my_string[0] = "Z"  #string-ის სიმბოლოების შეცვლა შეუძლებელია

# List-ში შეიძლება იყოს სხვადასხვა ტიპის მონაცემები
mixed_list = [1, "hello", True, 3.5]

# 6) String შეიცავს მხოლოდ სიმბოლოებს
string_example = "hello"

# 7) List იყენებს [] ფრჩხილებს, string — "" ბრჭყალებს
