// 10) ახსენით რა არის HTTP Module Node.js-ში, როგორ მუშაობს basic server (request, response), რა არის req და res ობიექტები. ახსენით status code-ებიც (200, 404)


// HTTP Module არის Node.js-ის ჩაშენებული (built-in) მოდული, რომელიც საშუალებას გვაძლევს შევქმნათ Web Server და ვიმუშაოთ HTTP მოთხოვნებთან (requests) და პასუხებთან (responses).

// მის გამოსაყენებლად არ არის საჭირო დამატებითი პაკეტის დაყენება.

// const http = require("http");

// როგორ მუშაოობს:

// როდესაც მოთხოვნა მოდის:

// იქმნება req (Request) ობიექტი.
// იქმნება res (Response) ობიექტი.
// სერვერი ამუშავებს მოთხოვნას.
// აბრუნებს პასუხს.

// req (Request) შეიცავს ინფორმაციას კლიენტის მოთხოვნის შესახებ.

// Property	აღწერა
// req.url	მოთხოვნილი მისამართი
// req.method	HTTP მეთოდი (GET, POST...)
// req.headers	Header-ები

// req (Request) შეიცავს ინფორმაციას კლიენტის მოთხოვნის შესახებ.

// res.write()	პასუხის ნაწილის გაგზავნა
// res.end()	პასუხის დასრულება
// res.setHeader()	Header-ის დამატება
// res.statusCode	სტატუს კოდის მითითება

// Status Codes

// HTTP Status Code აჩვენებს მოთხოვნის შედეგს.

// 200 OK

// ნიშნავს, რომ მოთხოვნა წარმატებით შესრულდა.

// 404 Not Found

// ნიშნავს, რომ მოთხოვნილი რესურსი ვერ მოიძებნა.