-- ახსენი განსხვავება:

-- რა არის SQL Database?

-- SQL Database არის რელაციური (Relational) მონაცემთა ბაზა, სადაც მონაცემები ინახება ცხრილების (Tables) სახით — სვეტებსა (Columns) და რიგებში (Rows). მონაცემებთან მუშაობა ხდება SQL (Structured Query Language) ენის გამოყენებით.

-- რა არის NoSQL Database?

-- NoSQL Database არის არარელაციური მონაცემთა ბაზა, რომელიც მონაცემებს არ ინახავს მხოლოდ ცხრილების სახით. ის შეიძლება იყენებდეს დოკუმენტებს (JSON), გასაღები-მნიშვნელობის (Key-Value) წყვილებს, გრაფებს ან სხვა სტრუქტურებს.

-- ჩამოთვალე მინიმუმ 3 განსხვავება SQL-სა და NoSQL-ს შორის.

-- SQL                                        	 NoSQL
-- მონაცემები ინახება ცხრილებში	      მონაცემები ინახება JSON დოკუმენტებში, Key-Value ფორმატში და სხვ.
-- აქვს ფიქსირებული სქემა (Schema)      	აქვს მოქნილი სქემა (Flexible Schema)
-- იყენებს SQL ენას	               არ იყენებს აუცილებლად SQL-ს