-- რა არის Database?

-- Database არის ორგანიზებული მონაცემების საცავი, სადაც ინფორმაცია ინახება სტრუქტურირებულად, რათა მისი მარტივად მოძებნა, დამატება, შეცვლა და წაშლა იყოს შესაძლებელი.

-- რა არის DBMS (Database Management System)?

-- DBMS არის პროგრამა, რომელიც მართავს მონაცემთა ბაზას. მისი დახმარებით ვქმნით, ვცვლით, ვშლით და ვკითხულობთ მონაცემებს.

-- რატომ ვიყენებთ database-ს პროგრამებში?x

-- მონაცემების მუდმივად შესანახად
-- დიდი რაოდენობის ინფორმაციის სამართავად
-- მონაცემების სწრაფად მოსაძებნად
-- უსაფრთხოების უზრუნველსაყოფად