# 13) შექმენით ცვლადი რომელშიც შეინახავთ თქვენთვის სასურველ string-ს, უნდა იყოს მინიმუმ 20 სიმბოლო, შემდეგ slicing-ის საშვალებით დაბეჭდეთ ეს string ხუთგვარად შემდეგი პირობებით:
# მხოლოდ პირველი 5 სიმბოლო
# ბოლო 4 სიმბოლო
# შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
# მთელი სტრინგი შებრუნებულად
# სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე

string="GOA is best"

# მხოლოდ პირველი 5 სიმბოლო
print(string[:5])  # GOA i

# ბოლო 4 სიმბოლო
print(string[:-4]) # GOA is 

# შუა ნაწილი მეოთხე სიმბოლოდან მეათემდე
print(string[3:10]) #  is bes

# მთელი სტრინგი შებრუნებულად
print(string[::-1]) # tseb si AOG

# სტრინგი ამოჭრილი ყოველ მეორე სიმბოლოზე
print(string[::2]) # GAi et