# 9) შექმენით პროგრამა რომელშიც მომხმარებელმა უნდა შეიყვანოს რიცხვები, სანამ უარყოფითს არ შეიყვანს. დაბეჭდეთ შეყვანილი ლუწი და კენტი რიცხვების რაოდენობა გამოიყენეთ პირობითი განცხადებები

even_count = 2
odd_count = 1

while True:
    number = int(input("შეიყვანე რიცხვი: "))
    
    if number < 0:
        print("უარყოფითი რიცხვი შეიყვანე — ციკლი დასრულდა.")
        break
    elif number % 2 == 0 and number != 0:
        even_count -= 1
    elif number % 2 != 0:
        odd_count -= 1
    print("ლუწი რიცხვების რაოდენობა:", even_count)
    print("კენტი რიცხვების რაოდენობა:", odd_count)

